-*- coding: utf-8 -*-
#+TITLE: 2020_03_diary.org
#+CREATOR: LEEJEONGPYO
#+STARTUP: showeverything indent logdrawer latexpreview
#+SEQ_TODO: NEXT(n/!) TODO(t@/!) WAITING(w@/!) SOMEDAY(s/!) PROJ(p) | Done(d@) CANCELLED(c)
#+TAGS: URGENT(u) COMPUTER(c) SHOPPING(s) FAMILY(f) PHONE(o) GARAGE(g) test(t)
#+PROPERTY: Effort_ALL 0:05 0:10 0:15 0:220 0:30 1:00 2:00 4:00 6:00 8:00
#+PROPERTY: Rating_ALL + ++ +++ ++++ +++++
#+COLUMNS: %8TODO(To Do) %40ITEM(Book) %15GENRE(Genre) %5PAGES(Pages)
#+ARCHIVE: archive_of_mine.org::
#+OPTIONS: d:t \n:t p:t todo:nil
#+TITLE: 목표를 달성하는 습관이 가장 큰 재산이다!
*** link
매일 듣고 익힐 사항링크{C-[ C-[ 숫자} , 도구, 정리는 나중에 하더라도 일단 수집.]]

(seethru 90) (seethru 100) file:seethru.org
- 닷파일로 옮길것. 즉, 따라서 설치하고 시행할 명령을 만들어서 
(require 'seethru)

help:seethru-relative 
seethru-relative
(seethru-relative -5) (seethru-relative +5)


file:pdf-tools.org
(finder-commentary "pdf-tools")
- org capture pdf text [[https://emacs.stackexchange.com/questions/51942/how-can-i-capture-selected-text-in-a-pdf-view-buffer-with-org-capture][How can I capture selected text in a pdf-view buffer with org-capture? - Emacs Stack Exchange]]
    연구필요함 대박이다. 문서의 부분을 자동으로 노트로 옮기는 기능이면 매우 혁신적이다.

(defun org-capture-pdf-active-region ()
  "Capture the active region of the pdf-view buffer."
  (let* ((pdf-buf-name (plist-get org-capture-plist :original-buffer))
         (pdf-buf (get-buffer pdf-buf-name)))
    (if (buffer-live-p pdf-buf)
        (with-current-buffer pdf-buf
          (car (pdf-view-active-region-text)))
      (user-error "Buffer %S not alive." pdf-buf-name))))

(setq org-capture-templates
      '(
        ("j" "Notes" entry (file+olp "/temp/Notes.org" "Notes")
         "* %?\n%(org-capture-pdf-active-region)\n")
        )
      )

latex fragment 12.5.2 
C-c C-x C-l

#+begin_src latex

\documentclass[12pt]{article}
\usepackage{lingmacros}
\usepackage{tree-dvips}
\begin{document}

\section*{Notes for My Paper}

Don't forget to include examples of topicalization.
They look like this:

{\small
\enumsentence{Topicalization from sentential subject:\\ 
\shortex{7}{a John$_i$ [a & kltukl & [el & 
  {\bf l-}oltoir & er & ngii$_i$ & a Mary]]}
{ & {\bf R-}clear & {\sc comp} & 
  {\bf IR}.{\sc 3s}-love   & P & him & }
{John, (it's) clear that Mary loves (him).}}
}

\subsection*{How to handle topicalization}

I'll just assume a tree structure like (\ex{1}).

{\small
\enumsentence{Structure of A$'$ Projections:\\ [2ex]
\begin{tabular}[t]{cccc}
    & \node{i}{CP}\\ [2ex]
    \node{ii}{Spec} &   &\node{iii}{C$'$}\\ [2ex]
        &\node{iv}{C} & & \node{v}{SAgrP}
\end{tabular}
\nodeconnect{i}{ii}
\nodeconnect{i}{iii}
\nodeconnect{iii}{iv}
\nodeconnect{iii}{v}
}
}

\subsection*{Mood}

Mood changes when there is a topic, as well as when
there is WH-movement.  \emph{Irrealis} is the mood when
there is a non-subject topic or WH-phrase in Comp.
\emph{Realis} is the mood when there is a subject topic
or WH-phrase.

\end{document}

#+end_src

#+RESULTS:
#+begin_export latex
\documentclass[12pt]{article}
\usepackage{lingmacros}
\usepackage{tree-dvips}
\begin{document}

\section*{Notes for My Paper}

Don't forget to include examples of topicalization.
They look like this:

{\small
\enumsentence{Topicalization from sentential subject:\\ 
\shortex{7}{a John$_i$ [a & kltukl & [el & 
  {\bf l-}oltoir & er & ngii$_i$ & a Mary]]}
{ & {\bf R-}clear & {\sc comp} & 
  {\bf IR}.{\sc 3s}-love   & P & him & }
{John, (it's) clear that Mary loves (him).}}
}

\subsection*{How to handle topicalization}

I'll just assume a tree structure like (\ex{1}).

{\small
\enumsentence{Structure of A$'$ Projections:\\ [2ex]
\begin{tabular}[t]{cccc}
    & \node{i}{CP}\\ [2ex]
    \node{ii}{Spec} &   &\node{iii}{C$'$}\\ [2ex]
        &\node{iv}{C} & & \node{v}{SAgrP}
\end{tabular}
\nodeconnect{i}{ii}
\nodeconnect{i}{iii}
\nodeconnect{iii}{iv}
\nodeconnect{iii}{v}
}
}

\subsection*{Mood}

Mood changes when there is a topic, as well as when
there is WH-movement.  \emph{Irrealis} is the mood when
there is a non-subject topic or WH-phrase in Comp.
\emph{Realis} is the mood when there is a subject topic
or WH-phrase.
achieve ‘zero-cost abstractions
\end{document}
#+end_export
